src/Documents/ПланП_ПланПроизводстваНаПериод/ПланП_ПланПроизводстваНаПериод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланП_ПланПроизводстваНаПериод</name>
  <registerRecords>InformationRegister.ПланП_ПланЗагрузкиРесурсов</registerRecords>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланПроизводстваПоРесурсам</name>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапПроизводства</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>РесурсПредприятия</name>
      <type>
        <types>CatalogRef.КлючевыеРесурсы</types>
      </type>
    </attributes>
    <attributes>
      <name>Старт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Финиш</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ПланП_ПланЗагрузкиРесурсов/ПланП_ПланЗагрузкиРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланП_ПланЗагрузкиРесурсов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Старт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Финиш</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РесурсПредприятия</name>
    <type>
      <types>CatalogRef.КлючевыеРесурсы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПланП_ПланПроизводстваНаПериод/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПланП_ПланЗагрузкиРесурсов
	Движения.ПланП_ПланЗагрузкиРесурсов.Записывать = Истина;
	Для Каждого ТекСтрокаПланПроизводстваПоРесурсам Из ПланПроизводстваПоРесурсам Цикл
		Движение = Движения.ПланП_ПланЗагрузкиРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.ЗаказНаПроизводство = ТекСтрокаПланПроизводстваПоРесурсам.ЗаказНаПроизводство;
		Движение.ЗаказПокупателя = ТекСтрокаПланПроизводстваПоРесурсам.ЗаказПокупателя;
		Движение.Клиент = ТекСтрокаПланПроизводстваПоРесурсам.Клиент;
		Движение.ЭтапПроизводства = ТекСтрокаПланПроизводстваПоРесурсам.ЭтапПроизводства;
		Движение.РесурсПредприятия = ТекСтрокаПланПроизводстваПоРесурсам.РесурсПредприятия;
		Движение.Старт = ТекСтрокаПланПроизводстваПоРесурсам.Старт;
		Движение.Финиш = ТекСтрокаПланПроизводстваПоРесурсам.Финиш;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
